#!/bin/bash

################################################################################################
#
#   Скрипт - волшебная палочка для автоматической настройки чистой Ubuntu.
#
#
################################################################################################


. ../scripts/lib.sh      # Подключение файлика с общими функциями

#----------------------------------------------------------------------------------------------#
#   Переменные
#----------------------------------------------------------------------------------------------#

# Конфигурируемая система
SYSTEM="Ubuntu"

# Счетчик заголовков
TITLE_COUNTER=1

# Префикс логов
PREFIX=": -------- : "

# Разделитель логов
DEVIDER=": -------- : -------- : -------- : -------- : -------- :"


#----------------------------------------------------------------------------------------------#
#   Конфигурация. Только строка "enable" означает, что компонент будет выполняться.
#   Закоммнтировать ненужное.
#----------------------------------------------------------------------------------------------#

FLAG_UPDATE_PACKAGES="enable"           # Обновление базовых пакетов системы
FLAG_ADDITIONAL_PACKAGES="enable"       # Установка дополнительных пакетов
FLAG_SET_ENVIRONMENT="enable"           # Настройка окружения
FLAG_SET_BASHRC="enable"                # Настройка файла .bashrc
FLAG_MAKE_BEAUTY="enable"               # Настройка красивостей


#----------------------------------------------------------------------------------------------#
#   Конфигурация системы
#----------------------------------------------------------------------------------------------#

# Обновление базовых пакетов системы.
if [ "${FLAG_UPDATE_PACKAGES}" ]
then
    ./conf-update-packages.sh
fi

# Установка дополнительных пакетов.
if [ "${FLAG_ADDITIONAL_PACKAGES}" ]
then
    ./conf-install-packages.sh
fi

# Настройка красивостей
if [ "${FLAG_MAKE_BEAUTY}" ]
then
    ./conf-make-beauty.sh
fi

# Настройка файла .bashrc
if [ "${FLAG_SET_BASHRC}" ]
then
    ./conf-set-bashrc.sh
fi

# Настройка окружения
if [ "${FLAG_SET_ENVIRONMENT}" ]
then
    ./conf-set-environment.sh
fi
