#!/bin/bash

################################################################################################
#
#   Скрипт - волшебная палочка для автоматической настройки чистой Ubuntu.
#
#
#
################################################################################################


#----------------------------------------------------------------------------------------------#
#   Переменные
#----------------------------------------------------------------------------------------------#

# Конфигурируемая система
SYSTEM="Ubuntu"


#----------------------------------------------------------------------------------------------#
#   Логгирование
#----------------------------------------------------------------------------------------------#

# Лог в случае ошибки с выходом из скрипта
function LOG_ERR
{
    echo -e "\nERROR: $1\n"
    echo -e "ERROR: \"${SYSTEM}\" configuration failed :("
    exit -1
}

# Штатный лог
function LOG
{
    echo -e "\n$1\n"
}


#----------------------------------------------------------------------------------------------#
#   Дополнительные функции
#----------------------------------------------------------------------------------------------#

# Выполнение команды, завернутое в лог
function EXECUTE
{
    LOG "Processing \"$1\"..."

    $1 || LOG_ERR $1

    LOG "... \"$1\" success!"
}

################################################################################################
#
#   Конфигурация системы
#
################################################################################################


#----------------------------------------------------------------------------------------------#
#   1. Обновление базовых пакетов системы.
#----------------------------------------------------------------------------------------------#

LOG "1. Base system packages updating."

# Проверка обновлений пакетов системы
EXECUTE "sudo apt update"

# Обновление пакетов системы
EXECUTE "sudo apt upgrade"




#----------------------------------------------------------------------------------------------#
#   123. Настройка красивостей
#----------------------------------------------------------------------------------------------#

LOG "123. Some beauty settings."

EXECUTE "wget --no-check-certificate https://raw.githubusercontent.com/strapidustra125/setup/master/pictures/wallpaper-mazda-back.jpg"