#!/bin/bash

################################################################################################
#
#   Скрипт - волшебная палочка для автоматической настройки чистой Ubuntu.
#
#
#
################################################################################################


#----------------------------------------------------------------------------------------------#
#   Переменные
#----------------------------------------------------------------------------------------------#

# Конфигурируемая система
SYSTEM="Ubuntu"

# Префикс логов
PREFIX=": -------- : "

# Разделитель логов
DEVIDER=": -------- : -------- : -------- : -------- : -------- :"


#----------------------------------------------------------------------------------------------#
#   Список пакетов для установки
#----------------------------------------------------------------------------------------------#

# apt
# "git"



# vscode


#----------------------------------------------------------------------------------------------#
#   Логгирование
#----------------------------------------------------------------------------------------------#

# Лог в случае ошибки с выходом из скрипта
function LOG_ERR
{
    echo -e "\n${PREFIX}ERROR: $1\n"
    echo -e "${PREFIX}ERROR: \"${SYSTEM}\" configuration failed :("
    exit -1
}

# Штатный лог
function LOG
{
    echo -e "\n${PREFIX}$1\n"
}

# Лог для группы команд
function LOG_TITLE
{
    echo -e "\n${DEVIDER}\n"
    LOG "$1"
}


#----------------------------------------------------------------------------------------------#
#   Дополнительные функции
#----------------------------------------------------------------------------------------------#

# Выполнение команды, завернутое в лог
function EXECUTE
{
    LOG "Processing \"$1\"..."

    $1 || LOG_ERR $1

    LOG "... \"$1\" success!"
}

################################################################################################
#
#   Конфигурация системы
#
################################################################################################


#----------------------------------------------------------------------------------------------#
#   1. Обновление базовых пакетов системы.
#----------------------------------------------------------------------------------------------#

LOG_TITLE "1. Base system packages updating."

# Проверка обновлений пакетов системы
EXECUTE "sudo apt update"

# Обновление пакетов системы
EXECUTE "sudo apt upgrade"



#----------------------------------------------------------------------------------------------#
#   123. Настройка окружения
#----------------------------------------------------------------------------------------------#

LOG_TITLE "123. Environment settings."



ADD_GIT_BRANCH="
# Change console welcome string and add current git branch
PS1='\[\033[0;32m\]\[\033[0m\033[0;32m\]\u\[\033[0;36m\] @ \[\033[0;36m\]\h \w\[\033[0;32m\]$(__git_ps1)\n\[\033[0;32m\]└─[\033[0m\033[0;32m\] \$\[\033[0m\033[0;32m\] ▶\[\033[0m\] '"

LOG "Changing console welcome string and add current git branch"
sudo echo "${ADD_GIT_BRANCH}" >> /home/$(logname)/.bashrc






#----------------------------------------------------------------------------------------------#
#   123. Настройка красивостей
#----------------------------------------------------------------------------------------------#

LOG_TITLE "123. Some beauty settings."

WP_DIR="/home/$(logname)/Pictures/wallpapers"
WP_FILE="wallpaper-mazda-back.jpg"
WP_URL="https://raw.githubusercontent.com/strapidustra125/setup/master/pictures/${WP_FILE}"

if ! [ -d ${WP_DIR} ];
then
    EXECUTE "mkdir ${WP_DIR}"
fi

if ! [ -d ${WP_DIR}/${WP_FILE}  ];
then
    EXECUTE "wget --no-check-certificate -O ${WP_DIR}/${WP_FILE} ${WP_URL}"
fi
