#!/bin/bash

################################################################################################
#
#   Общие функции, используемые во всех скриптах.
#
################################################################################################


#----------------------------------------------------------------------------------------------#
#   Логгирование
#----------------------------------------------------------------------------------------------#

# Лог в случае ошибки с выходом из скрипта
function LOG_ERR
{
    echo -e "\n${PREFIX}ERROR: $1\n"
    echo -e "${PREFIX}ERROR: \"${SYSTEM}\" configuration failed :("
    exit -1
}

# Штатный лог
function LOG
{
    echo -e "\n${PREFIX}$1\n"
}

# Лог для группы команд
function LOG_TITLE
{
    echo -e "\n${DEVIDER}\n"
    LOG "${TITLE_COUNTER}. $1"
    TITLE_COUNTER=$((${TITLE_COUNTER}+1))
}

#----------------------------------------------------------------------------------------------#
#   Дополнительные функции
#----------------------------------------------------------------------------------------------#

# Выполнение команды, завернутое в лог
function EXECUTE
{
    LOG "Processing \"$1\"..."

    $1 || LOG_ERR $1

    LOG "... \"$1\" success!"
}
